# 输入一段数字和字母组合，判断数字和字母各有多少个?

str = input("请输入一串数字和字母的组合 \n")

#定义统计数字的初始值
num_count = 0
#定义统计字母的初始化值
str_count = 0
#判断输入的这串组合是为数字和字母的组合(不包含特殊字符)
if str.isalnum():
    #遍历输入的这个字符串
    for s in str:
        #用遍历出的每个字符去判断是否为数字
        if s.isdigit():
            #如果是数字就让数字的计数变量加1
            num_count += 1
        # 用遍历出的每个字符去判断是否为字母
        elif s.isalpha():
            # 如果是字母就让字母的计数变量加1
            str_count += 1
    #分别打印出来数字和字母的个数
    print("你输入了%d个数字,输入了%s个字母"%(num_count,str_count))
#如果输入的有特殊字符串就输出输入的有误
else:
    print("你输入的有误")